export const tours = [
  {
    id: "1",
    type: "study",
    tourCode: "ADWINTER2024",
    title: "เรียนจีน เที่ยวหิมะเมืองหนาว",
    description:
      "เรียนภาษาจีนกับมหาวิทยาลัย HIT พร้อมการเรียนการสอนแบบ พูด ฟัง อ่าน และเขียน พร้อมเปิดประสบการณ์เที่ยวสถานที่ดังเมืองฮาร์บิน ชมเมืองหิมะเมืองหนาว ฉลองปีใหม่กับเมืองหิมะ - แม่น้ำซงฮวาเจียง - ถนนคนเดินจงหยาง - เมืองเก่าฮาร์บิน - สวนสาธารณะดนตรี - นั่งกระเช้าข้ามแม่น้ำซงหัว - พิพิธภัณฑ์เฮยหลงเจียง",
    image: "/images/tours/ADWINTER2024.webp",
    duration: "27 days",
    prices: {
      default: 55900,
    },
    location: "เมืองฮาร์บิน",
  },
  {
    id: "2",
    type: "study",
    tourCode: "ADSPRING2W2025",
    title: "เรียนจีน เที่ยวจีน",
    description:
      "เรียนภาษาจีนกับมหาวิทยาลัย HIT พร้อมการเรียนการสอนแบบ พูด ฟัง อ่าน และเขียน พร้อมเปิดประสบการณ์เที่ยวสถานที่ดังเมืองฮาร์บิน ชมเมืองหิมะเมืองหนาว ฉลองปีใหม่กับเมืองหิมะ - แม่น้ำซงฮวาเจียง - ถนนคนเดินจงหยาง - เมืองเก่าฮาร์บิน - สวนสาธารณะดนตรี - นั่งกระเช้าข้ามแม่น้ำซงหัว - พิพิธภัณฑ์เฮยหลงเจียง",
    image: "/images/tours/ADSPRING2W2025.png",
    duration: "14 days",
    prices: {
      default: 46900,
    },
    location: "เมืองฮาร์บิน",
  },
  {
    id: "3",
    type: "study",
    tourCode: "ADSTUDYMAR2W2025",
    title: "เรียนจีน",
    description:
      "โครงการเรียนต่อภาษาจีนกับ มหาวิทยาลัยเทคโนโลยีฮาร์บิน หนึ่งในมหาวิทยาลัยชั้นนำของประเทศจีน มีชื่อเสียงในด้านการวิจัยและการศึกษาในสาขาวิทยาศาสตร์และเทคโนโลยี ก่อตั้งขึ้นในปี 1920 และเป็นหนึ่งในมหาวิทยาลัยกลุ่ม C9 League ด้วยการเรียนการสอนเป็นแบบการพูด ฟัง อ่าน และการเขียน  พร้อมเปิดประสบการณ์เรียนมหาวิทยาลัยดัง Top 10 ของประเทศจีน Harbin Institute of Technology มหาวิทยาลัยชื่อดังของจีน",
    image: "/images/tours/ADSTUDYMAR2W2025.png",
    duration: "14 days",
    prices: {
      default: 39900,
    },
    location: "เมืองฮาร์บิน",
  },
  {
    id: "4",
    type: "study",
    tourCode: "ADSPRING3W2025",
    title: "เรียนจีน เที่ยวจีน",
    description:
      "เรียนภาษาจีนกับมหาวิทยาลัย HIT พร้อมการเรียนการสอนแบบ พูด ฟัง อ่าน และเขียน พร้อมเปิดประสบการณ์เที่ยวสถานที่ดังเมืองฮาร์บิน ชมเมืองหิมะเมืองหนาว ฉลองปีใหม่กับเมืองหิมะ - แม่น้ำซงฮวาเจียง - ถนนคนเดินจงหยาง - เมืองเก่าฮาร์บิน - สวนสาธารณะดนตรี - นั่งกระเช้าข้ามแม่น้ำซงหัว - พิพิธภัณฑ์เฮยหลงเจียง",
    image: "/images/tours/ADSTUDYMAR3W2025.png",
    duration: "21 days",
    prices: {
      default: 43900,
    },
    location: "เมืองฮาร์บิน",
  },
  {
    id: "5",
    type: "study",
    tourCode: "ADSTUDYMAR3W2025",
    title: "เรียนจีน",
    description:
      "โครงการเรียนต่อภาษาจีนกับ มหาวิทยาลัยเทคโนโลยีฮาร์บิน หนึ่งในมหาวิทยาลัยชั้นนำของประเทศจีน มีชื่อเสียงในด้านการวิจัยและการศึกษาในสาขาวิทยาศาสตร์และเทคโนโลยี ก่อตั้งขึ้นในปี 1920 และเป็นหนึ่งในมหาวิทยาลัยกลุ่ม C9 League ด้วยการเรียนการสอนเป็นแบบการพูด ฟัง อ่าน และการเขียน  พร้อมเปิดประสบการณ์เรียนมหาวิทยาลัยดัง Top 10 ของประเทศจีน Harbin Institute of Technology มหาวิทยาลัยชื่อดังของจีน",
    image: "/images/tours/ADSTUDYMAR3W2025.png",
    duration: "21 days",
    prices: {
      default: 43900,
    },
    location: "เมืองฮาร์บิน",
  },
  {
    id: "6",
    type: "study",
    tourCode: "ADSTUDYMAR1M2025",
    title: "เรียนจีน",
    description:
      "โครงการเรียนต่อภาษาจีนกับ มหาวิทยาลัยเทคโนโลยีฮาร์บิน หนึ่งในมหาวิทยาลัยชั้นนำของประเทศจีน มีชื่อเสียงในด้านการวิจัยและการศึกษาในสาขาวิทยาศาสตร์และเทคโนโลยี ก่อตั้งขึ้นในปี 1920 และเป็นหนึ่งในมหาวิทยาลัยกลุ่ม C9 League ด้วยการเรียนการสอนเป็นแบบการพูด ฟัง อ่าน และการเขียน  พร้อมเปิดประสบการณ์เรียนมหาวิทยาลัยดัง Top 10 ของประเทศจีน Harbin Institute of Technology มหาวิทยาลัยชื่อดังของจีน",
    image: "/images/tours/ADSTUDYMAR1M2025.png",
    duration: "30 days",
    prices: {
      default: 49900,
    },
    location: "เมืองฮาร์บิน",
  },
  {
    id: "7",
    type: "study",
    tourCode: "ADSTUDYMAR2M2025",
    title: "เรียนจีน",
    description:
      "โครงการเรียนต่อภาษาจีนกับ มหาวิทยาลัยเทคโนโลยีฮาร์บิน หนึ่งในมหาวิทยาลัยชั้นนำของประเทศจีน มีชื่อเสียงในด้านการวิจัยและการศึกษาในสาขาวิทยาศาสตร์และเทคโนโลยี ก่อตั้งขึ้นในปี 1920 และเป็นหนึ่งในมหาวิทยาลัยกลุ่ม C9 League ด้วยการเรียนการสอนเป็นแบบการพูด ฟัง อ่าน และการเขียน  พร้อมเปิดประสบการณ์เรียนมหาวิทยาลัยดัง Top 10 ของประเทศจีน Harbin Institute of Technology มหาวิทยาลัยชื่อดังของจีน",
    image: "/images/tours/ADSTUDYMAR2M2025.png",
    duration: "60 days",
    prices: {
      default: 59900,
    },
    location: "เมืองฮาร์บิน",
  },
  {
    id: "8",
    type: "study",
    tourCode: "ADSTUDYMAR3M2025",
    title: "เรียนจีน",
    description:
      "โครงการเรียนต่อภาษาจีนกับ มหาวิทยาลัยเทคโนโลยีฮาร์บิน หนึ่งในมหาวิทยาลัยชั้นนำของประเทศจีน มีชื่อเสียงในด้านการวิจัยและการศึกษาในสาขาวิทยาศาสตร์และเทคโนโลยี ก่อตั้งขึ้นในปี 1920 และเป็นหนึ่งในมหาวิทยาลัยกลุ่ม C9 League ด้วยการเรียนการสอนเป็นแบบการพูด ฟัง อ่าน และการเขียน  พร้อมเปิดประสบการณ์เรียนมหาวิทยาลัยดัง Top 10 ของประเทศจีน Harbin Institute of Technology มหาวิทยาลัยชื่อดังของจีน",
    image: "/images/tours/ADSTUDYMAR3M2025.png",
    duration: "90 days",
    prices: {
      default: 79900,
    },
    location: "เมืองฮาร์บิน",
  },
  {
    id: "9",
    type: "study",
    tourCode: "ADSUMMER2025",
    title: "เรียนจีน เที่ยวจีน",
    description:
      "เรียนภาษาจีนกับมหาวิทยาลัย HIT พร้อมการเรียนการสอนแบบ พูด ฟัง อ่าน และเขียน พร้อมเปิดประสบการณ์เที่ยวสถานที่ดังเมืองฮาร์บิน ชมเมืองหิมะเมืองหนาว ฉลองปีใหม่กับเมืองหิมะ - แม่น้ำซงฮวาเจียง - ถนนคนเดินจงหยาง - เมืองเก่าฮาร์บิน - สวนสาธารณะดนตรี - นั่งกระเช้าข้ามแม่น้ำซงหัว - พิพิธภัณฑ์เฮยหลงเจียง",
    image: "/images/tours/ADSUMMER2025.png",
    duration: "27 days",
    prices: {
      default: 53900,
    },
    location: "เมืองฮาร์บิน",
  },
  {
    id: "10",
    type: "study",
    tourCode: "ADWINTER2025",
    title: "เรียนจีน เที่ยวจีน",
    description:
      "เรียนภาษาจีนกับมหาวิทยาลัย HIT พร้อมการเรียนการสอนแบบ พูด ฟัง อ่าน และเขียน พร้อมเปิดประสบการณ์เที่ยวสถานที่ดังเมืองฮาร์บิน ชมเมืองหิมะเมืองหนาว ฉลองปีใหม่กับเมืองหิมะ - แม่น้ำซงฮวาเจียง - ถนนคนเดินจงหยาง - เมืองเก่าฮาร์บิน - สวนสาธารณะดนตรี - นั่งกระเช้าข้ามแม่น้ำซงหัว - พิพิธภัณฑ์เฮยหลงเจียง",
    image: "/images/tours/ADWINTER2025.webp",
    duration: "27 days",
    prices: {
      default: 55900,
    },
    location: "เมืองฮาร์บิน",
  },
  {
    id: "11",
    type: "study",
    tourCode: "ADSTUDYMAR2W2025",
    title: "เรียนจีน",
    description:
      "Harbin Normal University มหาวิทยาลัยใจกลางเมืองฮาร์บิน เป็นมหาวิทยาลัยที่มีชื่อเสียงในฮาร์บิน ประเทศจีน มหาวิทยาลัยนี้มีบทบาทสำคัญในการผลิตครูและบุคลากรทางการศึกษาที่มีคุณภาพสูง",
    image: "/images/tours/ADSTUDYMAR2W2025.png",
    duration: "14 days",
    prices: {
      shared: 39900,
      single: 41900,
    },
    location: "เมืองฮาร์บิน",
  },
  {
    id: "12",
    type: "study",
    tourCode: "ADSTUDYMAR3W2025",
    title: "เรียนจีน",
    description:
      "Harbin Normal University มหาวิทยาลัยใจกลางเมืองฮาร์บิน เป็นมหาวิทยาลัยที่มีชื่อเสียงในฮาร์บิน ประเทศจีน มหาวิทยาลัยนี้มีบทบาทสำคัญในการผลิตครูและบุคลากรทางการศึกษาที่มีคุณภาพสูง",
    image: "/images/tours/ADSTUDYMAR3W2025.png",
    duration: "21 days",
    prices: {
      shared: 41900,
      single: 45900,
    },
    location: "เมืองฮาร์บิน",
  },
  {
    id: "13",
    type: "study",
    tourCode: "ADSTUDYMAR1M2025",
    title: "เรียนจีน",
    description:
      "Harbin Normal University มหาวิทยาลัยใจกลางเมืองฮาร์บิน เป็นมหาวิทยาลัยที่มีชื่อเสียงในฮาร์บิน ประเทศจีน มหาวิทยาลัยนี้มีบทบาทสำคัญในการผลิตครูและบุคลากรทางการศึกษาที่มีคุณภาพสูง",
    image: "/images/tours/ADSTUDYMAR1M2025.png",
    duration: "30 days",
    prices: {
      shared: 47900,
      single: 50900,
    },
    location: "เมืองฮาร์บิน",
  },
  {
    id: "14",
    type: "study",
    tourCode: "ADSTUDYMAR2M2025",
    title: "เรียนจีน",
    description:
      "Harbin Normal University มหาวิทยาลัยใจกลางเมืองฮาร์บิน เป็นมหาวิทยาลัยที่มีชื่อเสียงในฮาร์บิน ประเทศจีน มหาวิทยาลัยนี้มีบทบาทสำคัญในการผลิตครูและบุคลากรทางการศึกษาที่มีคุณภาพสูง",
    image: "/images/tours/ADSTUDYMAR2M2025.png",
    duration: "60 days",
    prices: {
      shared: 62900,
      single: 65900,
    },
    location: "เมืองฮาร์บิน",
  },
  {
    id: "15",
    type: "study",
    tourCode: "ADSTUDYMAR3M2025",
    title: "เรียนจีน",
    description:
      "Harbin Normal University มหาวิทยาลัยใจกลางเมืองฮาร์บิน เป็นมหาวิทยาลัยที่มีชื่อเสียงในฮาร์บิน ประเทศจีน มหาวิทยาลัยนี้มีบทบาทสำคัญในการผลิตครูและบุคลากรทางการศึกษาที่มีคุณภาพสูง",
    image: "/images/tours/ADSTUDYMAR3M2025.png",
    duration: "90 days",
    prices: {
      shared: 79900,
      single: 89900,
    },
    location: "เมืองฮาร์บิน",
  },
  {
    id: "16",
    type: "study",
    tourCode: "ADSTUDY1YNORMAL",
    title: "เรียนจีน",
    description:
      "Harbin Normal University มหาวิทยาลัยใจกลางเมืองฮาร์บิน เป็นมหาวิทยาลัยที่มีชื่อเสียงในฮาร์บิน ประเทศจีน มหาวิทยาลัยนี้มีบทบาทสำคัญในการผลิตครูและบุคลากรทางการศึกษาที่มีคุณภาพสูง",
    image: "/images/tours/ADSTUDY1YNORMAL.png",
    duration: "1 year",
    prices: {
      default: 149900,
    },
    location: "เมืองฮาร์บิน",
  },
  {
    id: "17",
    type: "study",
    tourCode: "ADSTUDY1YHIT",
    title: "เรียนจีนระยะยาว",
    description:
      "Harbin Normal University มหาวิทยาลัยใจกลางเมืองฮาร์บิน เป็นมหาวิทยาลัยที่มีชื่อเสียงในฮาร์บิน ประเทศจีน มหาวิทยาลัยนี้มีบทบาทสำคัญในการผลิตครูและบุคลากรทางการศึกษาที่มีคุณภาพสูง",
    image: "/images/tours/ADSTUDY1YHIT.png",
    duration: "1 year",
    prices: {
      default: 179900,
    },
    location: "เมืองฮาร์บิน",
  },
  {
    id: "18",
    type: "study",
    tourCode: "ADSTUDY1TNORMAL",
    title: "เรียนภาษาจีน",
    description:
      "Harbin Normal University มหาวิทยาลัยใจกลางเมืองฮาร์บิน เป็นมหาวิทยาลัยที่มีชื่อเสียงในฮาร์บิน ประเทศจีน มหาวิทยาลัยนี้มีบทบาทสำคัญในการผลิตครูและบุคลากรทางการศึกษาที่มีคุณภาพสูง",
    image: "/images/tours/ADSTUDY1TNORMAL.png",
    duration: "1 term",
    prices: {
      shared: 89900,
      single: 109900,
    },
    location: "เมืองฮาร์บิน",
  },
  {
    id: "19",
    type: "study",
    tourCode: "ADSTUDY1THIT",
    title: "เรียนภาษาจีน",
    description:
      "Harbin Normal University มหาวิทยาลัยใจกลางเมืองฮาร์บิน เป็นมหาวิทยาลัยที่มีชื่อเสียงในฮาร์บิน ประเทศจีน มหาวิทยาลัยนี้มีบทบาทสำคัญในการผลิตครูและบุคลากรทางการศึกษาที่มีคุณภาพสูง",
    image: "/images/tours/ADSTUDY1THIT.png",
    duration: "1 term",
    prices: {
      default: 99900,
    },
    location: "เมืองฮาร์บิน",
  },
]

export type Tour = (typeof tours)[number]

export type TourType = "study" | "travel"
